<head>
    <style type="text/css" media="print">
    @page
        {
            size: auto;   /* กำหนดขนาดของหน้าเอกสารเป็นออโต้ครับ */
            margin: 0 0 0 0mm;  /* กำหนดขอบกระดาษเป็น 0 มม. */
            font-size:30px;
        }
    body
        {
            size: auto;
            margin: 0 0 0 0px;  /* เป็นการกำหนดขอบกระดาษของเนื้อหาที่จะพิมพ์ก่อนที่จะส่งไปให้เครื่องพิมพ์ครับ */
            font-size:30px;
        }
    </style>
</head>
<body bgcolor=#FFFFFF topmargin=0 leftmargin=0
<div align=center>
        ==================================<br>
    TEST PRINTER<br>
        ==================================<br>
        TEST1 -------------------------------- 1<br>
        TEST1 -------------------------------- 1<br>
        ผักกาดขาว --------------------------- 1<br>
        TEST1 -------------------------------- 1<br>
        คอหมู -------------------------------- 1<br>
        ==================================<br>
</div>
</body>

<a href="javascript:window.print()">สั่งพิมพ์</a>